/*
Задача 20: Insertion sort
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Անհրաժեշտ է, որ ծրագիրը արտածի հաջորդականության տարրերը դասավորված նվազման կարգով։ 
Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ 
Խնդիրը լուծելիս օգտագործել զանգված և insertion sort ալգորիթմ։ (դաս 8)
*/
#include <iostream>
int main ()
{
  unsigned int N, i, j;
  int a[1000], num, swapp;
  ///////////////////////////////////
  std::cin >> N;
  for (i = 0; i < N; i++)
  {
    std::cin >> num;
    a[i] = num;
  }
  //////////////////////////////////
  for (i = 1; i < N; i++)
  {
    for (j = i; j > 0; j--)
    {
      if (a[j-1] < a[j])
      {
        swapp = a[j-1];
        a[j -1] = a[j];
        a[j] = swapp;
      }
    }
  }
  ////////////////////////////
  for( i = 0; i < N; i++)
  {
    std::cout << a[i] << " ";
  }

}