/*
Задача 19: Պայմանով արտահայտություն
Գրել ծրագիր, որը մոտքում կստանա A, B, C և D ամբողջ թվերը։ 
Պահանջվում է արտածել A և D թվերի արտադրյալի ու B և C թվերի գումարի տարբերությունը, 
եթե A-ն գերազանցում է C֊ն։ 
B և D թվերի գումարի և A֊ի արտադրյալը, եթե C-ն գերազանցում է A֊ն: 
Հակառակ դեպքում բոլոր չորս թվերի գումարը։ (դաս 4)
*/
#include <iostream>
int main () 
{
	int A, B, C, D;
	std::cin >> A >> B >> C >> D;
	if (A > C)
	{
	std::cout << A * D - (B + C);
	}
	else if (A < C)
	{
	std::cout << (B + D) * A;
	}
	else
	{
	std::cout << A + B + C + D;
	}
}