/*
Задача 13: Նախ բացասականները
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) ոչ բացասական ամբողջ թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Անհրաժեշտ է, որ ծրագիրը նախ արտածի հաջորդականության բացասական տարրերը ապա ոչ բացասականները։ 
Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ 
Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)
*/
#include <iostream>
int main ()
{
  unsigned int N, i, j = 0;
  int num;
  int arr[1000];
  int positNum[1000];
  std::cin >> N;
  for (i = 0; i < N; i++)
  {
    std::cin >> num;
    arr[i] = num;
  }
  for(i = 0; i < N; i++)
  {
    if (arr [i] < 0)
    {
      std::cout << arr[i] << " ";
    }
    else 
    {
      positNum[j] = arr[i];
      j++;
    }
  }
    for(i = 0; i < j; i++)
    {
      std::cout << positNum[i] << " ";
    }
  }
