/*
Задача 15: Հայելային գումար
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է n (n ≤ 1000) բնական թիվ, 
ապա a0, a1, a2, ... an-1 ամբողջ թվերի հաջորդականությունը և կարտածի b0, b1, b2, ... b(n/2-1)։ 
Որտեղ bi = ai + an - i - 1։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ 
Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)
*/
#include <iostream>
int main () 
{
  unsigned int n;
  int a[1000];
  int i, num ;
  std::cin >> n;
  for (i = 0; i < n; i++)
  {
    std::cin >> num;
    a[i] = num;
  }

  for (i = 0; i < n/2; i++)
  {
    std::cout << a[i] + a[n-1-i] << " ";
  }
}

