/*
Задача 17: Չի կրկնվում միայն
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 100) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Հայտնի է, որ հաջորդականության բոլոր տարրերը հանդիպում են ճիշտ երկու անգամ բացառությամբ մեկի։ 
Պահանջվում է արտածել մեկ անգամ հանդիպող տարրը և կարգահամարը հաջորդականությունում։ 
Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)
*/
#include <iostream>
  int main() 
{
  unsigned int N, i, j;
  int a[100], num;
  bool repeate;
  std::cin >> N;
  for (i = 0; i < N; i++)
  {
    std::cin >> num;
    a[i] = num;
  }

  for (i = 0; i < N ;i++)
  {
    repeate = false;
    for (j = 0; j < N; j++)
    {
      if (a[i]==a[j] && i != j)
      { repeate = true;
        break;
      }
    }
    if(repeate == false)
    {
      std::cout << a[i] << " " << i;
    }
  }
}