/*
Задача 10: Հակառակ կարգ
Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Որպես արդյունք ծրագիրը պետք է արտածի հաջորդականությունը հակառակ կարգով։ 
Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)
*/
#include <iostream>
int main () 
{
  unsigned int N, i;
  const int size = 1000;
  int arr[size];
  int num;
  std::cin >> N;

for (i = 0; i < N; i++)
    {
        std::cin >> num;
        arr[i] = num; 
    }
    
for (i = N; i > 0; i--)

    {
        std::cout << arr[i-1] << " ";
    }

}
 
