/*
Задача 9: Մեծագույն տարրի հաճախակիություն
Գրել ծրագիր, որը մուտքում ստանում է N ոչ բացասական ամբողջ թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Որպես արդյունք ծրագիրը պետք է արտածի հաջորդականությունում 
մեծագույն տարրի հանդիպելու քանակը։ 
Խնդիրը լուծել առանց զանգված օգտագործելու։ (դաս 5, 6)
*/
#include <iostream>
#include <limits.h>
int main () 
{
    unsigned int N, i = 0, count = 0;
    int num, max = INT_MIN;
    std::cin >> N;
    while (i < N)
    {
        std::cin >> num;
        if(num > max) 
            {   
                count = 0;
                max = num;
                
            }
        if(num == max)
            {
            count++;
            }
            
    i++;
    }
    
   std::cout << count; 

}