/*
Задача 6: Ճիշտ K հատ
Պահանջվում է գրել ծրագիր, որը մուտքում կստանա N և K ոչ բացասական ամբողջ թվերը, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ 
Ծրագիրը որպես արդյունք պետք է արտածի 
՛YES՛ եթե N թվերից ճիշտ K հատը մեծ են կամ հավասար 123֊ից և 
՛NO՛ հակառակ դեպքում։ 
Խնդիրը լուծել առանց զանգված օգտագործելու։ (դաս 5, 6)
*/
#include <iostream>
int main ()
{
    unsigned int N, K,
    i=0,
    count=0;
    int num;
    std::cin >> N >> K;
    while(i<N)
    {
        std::cin >> num;
        if (num >= 123)
        {
            count++;
        }
        i++;
    }
    
    if(K == count)
    {
        std::cout << "YES";
    }
    else
    {
        std::cout << "NO";
    }
}